# 1. Load the ratings by user information that you collected into a pandas dataframe.

In [3]:
import pandas as pd

In [4]:
movies = pd.DataFrame(pd.read_csv("Movies.csv"))

In [141]:
movies.head()

,Name,American Sniper,Edge of Tomorrow,Groundhog Day,Jurassic World,Lost in Translation,Lucy
0,John,5.0,4.0,3,NaN,NaN,4.0
1,Logan,4.0,NaN,3,3.0,NaN,NaN
2,Modesto,NaN,NaN,4,NaN,4.0,4.0
3,Malcolm,NaN,NaN,2,NaN,4.0,NaN
4,Maurice,5.0,4.0,4,2.0,3.0,3.0

# 2. Show the average ratings for each user and each movie.

In [11]:
movies.mean()

American Sniper        4.666667
Edge of Tomorrow       4.000000
Groundhog Day          3.200000
Jurassic World         2.500000
Lost in Translation    3.666667
Lucy                   3.666667
dtype: float64

In [12]:
movies['Avg'] = movies.mean(1)

In [23]:
movies.groupby('Name').mean()['Avg']

Name
John       4.000000
Logan      3.333333
Malcolm    3.000000
Maurice    3.500000
Modesto    4.000000
Name: Avg, dtype: float64

# 3.Create a new pandas dataframe, with normalized ratings for each user.   
# Again, show the average
ratings for each user and each movie

In [5]:
new_movie = pd.DataFrame(pd.read_csv("Movies_Normalize.csv"))

In [6]:
new_movie['American Sniper'].max()

5

In [52]:
def normalize(column=[], *arg):
    return (column - column.min())/(column.max() - column.min())

In [88]:
for col in range(1,len(new_movie.columns)):
    new_movie.iloc[:,col] = normalize(new_movie.iloc[:,col])

new_movie

,Name,American Sniper,Edge of Tomorrow,Groundhog Day,Jurassic World,Lost in Translation,Lucy
0,John,1.0,1.0,0.5,0.000000,0.00,1.00
1,Logan,0.8,0.0,0.5,1.000000,0.00,0.00
2,Modesto,0.0,0.0,1.0,0.000000,1.00,1.00
3,Malcolm,0.0,0.0,0.0,0.000000,1.00,0.00
4,Maurice,1.0,1.0,1.0,0.666667,0.75,0.75

In [89]:

new_movie.mean()

American Sniper        0.560000
Edge of Tomorrow       0.400000
Groundhog Day          0.600000
Jurassic World         0.333333
Lost in Translation    0.550000
Lucy                   0.550000
dtype: float64

In [90]:
new_movie.mean(1)

0    0.583333
1    0.383333
2    0.500000
3    0.166667
4    0.861111
dtype: float64

In [91]:
new_movie['Avg'] = new_movie.mean(1)

In [92]:
new_movie.groupby('Name').mean()['Avg']

Name
John       0.583333
Logan      0.383333
Malcolm    0.166667
Maurice    0.861111
Modesto    0.500000
Name: Avg, dtype: float64

In [93]:
new_movie

,Name,American Sniper,Edge of Tomorrow,Groundhog Day,Jurassic World,Lost in Translation,Lucy,Avg
0,John,1.0,1.0,0.5,0.000000,0.00,1.00,0.583333
1,Logan,0.8,0.0,0.5,1.000000,0.00,0.00,0.383333
2,Modesto,0.0,0.0,1.0,0.000000,1.00,1.00,0.500000
3,Malcolm,0.0,0.0,0.0,0.000000,1.00,0.00,0.166667
4,Maurice,1.0,1.0,1.0,0.666667,0.75,0.75,0.861111

# 4. Provide a text-based conclusion: explain what might be advantages and disadvantages of using normalized ratings instead of the actual ratings.

Real benefits of normalization is make our data storage more efficient and to make it easier and faster to update our data.No duplication is required for normalization.
Some disadvantage of normalization are 
since data is not duplicated, table joins are required. This makes queries more complicated, and thus read times are slower.
Indexing does not work as efficiently. This makes read times slower because the joins donâ€™t typically work well with indexing.